# StairsTrisertypeRiserTreadConnection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTrisertypeRiserTreadConnection Property
ParameterTypeId Class See Also
---
"Riser To Tread Connection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTrisertypeRiserTreadConnection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTrisertypeRiserTreadConnection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTrisertypeRiserTreadConnection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace